In [1]:
import pandas as pd
import pandasql as psql
from pandasql import sqldf
import copy
import numpy as np

In [2]:
df = pd.DataFrame({
    'id':[1,2,3,4],
    'Salary':[100,200,50,300,]
})

In [3]:
df.head()

   id  Salary
0   1     100
1   2     200
2   3      50
3   4     300

# PROBLEM #1: Second Highest Salary
    Write a SQL query to get the second highest salary from the Employee table. For example,
    given the Employee table below, the query should return 200 as the second highest salary. If
    there is no second highest salary, then the query should return null 
    
    OFFSET : offset is used with the ORDER BY clause to disregard the top n rows that
    you specify. This will be useful as youâ€™ll want to get the second row (2nd highest
    salary)

In [4]:
pysqldf = lambda q: sqldf(q, globals())

In [5]:
query = """
        SELECT DISTINCT Salary
        FROM df
        ORDER BY Salary DESC
        LIMIT 1 OFFSET 1
        
        """

In [6]:
print(pysqldf(query))

   Salary
0     200

In [7]:
df

   id  Salary
0   1     100
1   2     200
2   3      50
3   4     300

# PROBLEM 2: Duplicate Emails
Write a SQL query to find all duplicate emails in a table named Person

In [22]:
Person = pd.DataFrame({'id':[1,2,3,4],
                      'email':['abc@gmail.com','bcd@gmail.com','xyz@gmail.com','abc@gmail.com']})

In [23]:
Person.columns

Index(['id', 'email'], dtype='object')

In [28]:
sql = """
      SELECT email
      FROM (SELECT email, COUNT(email) as count_eamil
      FROM Person
      GROUP BY email) as email_count
      WHERE count_eamil>1
        """

In [29]:
print(pysqldf(sql))

           email
0  abc@gmail.com

In [30]:
sql2 =""" 
        SELECT email
        FROM Person
        GROUP BY email
        HAVING COUNT(email)>1
      """

In [31]:
print(pysqldf(sql2))

           email
0  abc@gmail.com

# PROBLEM #3: Rising Temperature
Given a Weather table, write a SQL query to find all dates' Ids with higher temperature
compared to its previous (yesterday's) dates

In [106]:
Weather = pd.DataFrame({'id':[1,2,3,4],
                       'Date':['2015-01-01','2015-01-02','2015-01-03','2015-01-04'],
                       'Temperature':[30,20,45,35]})

In [134]:
Weather['Date'] = pd.to_datetime(Weather['Date'])

In [144]:
Weather['Day'] = Weather['Date'].dt.day

In [153]:
 #WHERE a.Temperature > b.Temperature 
sql3= """
    SELECT DISTINCT a.Id,a.Date
    FROM Weather a, Weather b
    WHERE (a.Temperature > b.Temperature) AND (a.Date-b.Date)=1
    
    """

In [154]:
pysqldf(sql3)

Empty DataFrame
Columns: [id, Date]
Index: []

# PROBLEM #4: Department Highest Salary
The Employee table holds all employees. Every employee has an Id, a salary, and there is also
a column for the department Id.

In [155]:
Employee = pd.DataFrame({
    'Id': [1,2,3,4,5],
    'Name':['Jo','Jim','Big','Ming','ping'],
    'Salary':[1235,3214,56834,85342,98734],
    'DepartmentId':[1,1,2,2,1]
})

In [156]:
Employee

   Id  Name  Salary  DepartmentId
0   1    Jo    1235             1
1   2   Jim    3214             1
2   3   Big   56834             2
3   4  Ming   85342             2
4   5  ping   98734             1

In [158]:
Department = pd.DataFrame({
    'Id':[1,2],
    'Name':['IT','Sales'],
})

In [159]:
Department

   Id   Name
0   1     IT
1   2  Sales

## Write a SQL query to find employees who have the highest salary in each of the departments. For the above tables, your SQL query should return the following rows (order of rows does not matter

In [166]:
query5 = """
        SELECT Employee.Name as Employee,  Department.Id as Department ,Department.Name as Dept_Name,Salary 
        FROM Employee
        INNER JOIN Department ON Employee.DepartmentId = Department.Id
        WHERE (DepartmentId,Salary) 
        IN(SELECT DepartmentId,MAX(Salary)
        FROM Employee
        GROUP BY DepartmentId)
        
        """

In [167]:
pysqldf(query5)

  Employee  Department Dept_Name  Salary
0     Ming           2     Sales   85342
1     ping           1        IT   98734